readme: full visual overhaul
